# OpenAndSolidGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..OpenAndSolidGeometry Property
BuiltInFailures..::..MassFailures Class See Also
---
Mass contains both solid and mesh geometry. Mass Floors, volume, and surface area, may appear incorrect.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpenAndSolidGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpenAndSolidGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpenAndSolidGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace